vows = ("+", "А", "Е", "И", "О", "У", "Ъ", "Ы", "Ь", "Ю", "Я")

cons = (
    "Б",
    "В",
    "Г",
    "Д",
    "Ж",
    "З",
    "К",
    "Л",
    "М",
    "Н",
    "П",
    "Р",
    "С",
    "Т",
    "Ф",
    "Х",
    "Ц",
    "Ч",
    "Ш",
    "Щ",
)

cons_soft = ("З", "Л", "Н", "Р", "С")

cons_hush = ("Ж", "ЖД", "Ц", "Ч", "Ш", "ШТ", "Щ")

cons_sonor = ("Л", "М", "Н", "Р")

cons_palat = ("К", "Г", "Х")

palat_1 = {"Ч": "К", "Ж": "Г", "Ш": "Х"}

palat_1_jo = {"Ч": "Ц", "Ж": "З", "Ш": "С"}

palat_2 = {"Ц": "К", "З": "Г", "С": "Х", "Т": "К"}
